{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DATA ENGINEERING PLATFORMS (MSCA 31012)\n",
    "### File       :   PythonNeo4JDB\n",
    "#### Desc      :   Python-Neo4j for movies database\n",
    "#### Authors :   Shreenidhi Bharadwaj\n",
    "#### Date       :   11/15/2018                      \n",
    " \n",
    "Installation:\n",
    "`pip install py2neo` | \n",
    "`pip install ipython-cypher`\n",
    "\n",
    "py2neo is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j:\n",
    "\n",
    "1. Install and start Neo4J on your local machine.\n",
    "2. Make sure to run Neo4J and make sure it is running using the below URL\n",
    "    http://localhost:7474/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "!pip install py2neo\n",
    "!pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from py2neo import authenticate\n",
    "from py2neo import Node\n",
    "from py2neo import Relationship\n",
    "import networkx as nx\n",
    "from py2neo import Graph as PGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# set up authentication parameters\n",
    "authenticate(\"localhost:7474\", \"neo4j\", \"root\")\n",
    "\n",
    "# connect to authenticated graph database\n",
    "graph = Graph(\"http://localhost:7474/db/data/\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# delete all the data\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Nodes - Create nodes with the Node class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Relationships - Create relationships between nodes with the Relationship class.\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n",
      "('name': 'Drew', 'drink': 'Mountain Dew')\n"
     ]
    }
   ],
   "source": [
    "# Cypher - Retrieve Cypher query results with Graph.cypher.execute.\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "# Parameterized Cypher - Pass parameters to Cypher queries by passing additional key-value arguments to Graph.cypher.execute. Parameters in Cypher are named and are wrapped in curly braces.\n",
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# ipython-cypher - ipython-cypher exposes %cypher magic in Jupyter. \n",
    "% load_ext cypher\n",
    "% load_ext Cython"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note: %cypher is intended for single-line Cypher queries and %%cypher is intended for multi-line Cypher queries. Please do make sure that you are authenticated to use cypher."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0],\n",
       " ['Drew', 'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:root@localhost:7474/db/data\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher http://neo4j:root@localhost:7474/db/data MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "RangeIndex(start=0, stop=3, step=1)"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name      drink\n",
       "1  Nicole  Coke Zero"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Nicole\n",
       "1    Nicole\n",
       "2      Drew\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# NetworkX Graphs - Cypher query results can be coerced to NetworkX MultiDiGraphs, graphs that permit multiple edges between nodes, with the get_graph method. You'll first need to install NetworkX with pip install networkx."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAecAAAFCCAYAAADL3BUJAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMi4yLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvhp/UCwAAHghJREFUeJzt3Wt0VOW9x/HfcAnJQE0mASQQDCG2\nntoST2tCCdCWBJUSRSEIKGjlUqpQ78VLqC1FqWAPLQoqRdeqkVulUasiRAURUJQSqjZIbZEECIFg\nAoQAJuGSzHkxHcxlJjCZmew9s7+ftXjhTDL507XoN88ze55tczqdTgEAANNoZ/QAAACgMeIMAIDJ\nEGcAAEyGOAMAYDLEGQAAkyHOAACYDHEGAMBkiDMAACZDnAEAMBniDACAyRBnAABMhjgDAGAyxBkA\nAJMhzgAAmAxxBgDAZIgzAAAmQ5wBADAZ4gwAgMkQZwAATIY4AwBgMsQZAACTIc4AAJgMcQYAwGSI\nMwAAJkOcAQAwmQ5GDxAWysul3FypsFCqqpKio6WUFGnSJKlbN6OnAwCEGJvT6XQaPUTIKiiQ5s6V\n8vNd/11b+/VzUVGS0ykNHy7l5EhpacbMCAAIOcS5tRYvlmbMkGpqXBH2xmZzhXr+fGnatLabDwAQ\nstjWbg13mKurz/+1Tqfr62bMcP03gQYAnAcrZ18VFEhDhlxYmJuy26VNm6TU1ICPBQAIH1yt7au5\nc11b2a1RU+P6fgAAWsDK2Rfl5VJiYuMLv3wVGSmVlHAVNwDAK1bOvsjN9fsl6iU5A/A6AIDwxcrZ\nF7fcIq1Y4ffLrGzfXo//z/8oOTn53J++ffsqOTlZffr0UURERACGBQCEKq7W9kVVVUBepktdnXbu\n3KmdO3c2e65du3bq3bt3o3A3jHd0dHRAZgAAmBdx9kWAwnishefq6+u1b98+7du3Txs2bGj2fFxc\nnNdwx8fHq1073qkAgFBHnH2RkiK98opfF4RVSyr0Y4QjR47oyJEj2rZtW7PnIiMjz4W6abz79Omj\nTp06+fGTAQBthfecfRGAq7WdkZE6+skn2l1VpeLiYhUVFTX6c/DgwQAO/DWbzeZxu9wd75iYmKD8\nXACA74izr7Kzpddea/nITi/qJTlvuEHtX3vN69dUV1drz549KioqahbvPXv26MyZM34M711sbKzH\ncLNdDgBtjzj7yo8Twr6SNHPgQP1+w4ZWbTHX1dWptLS0UbAbBrwqQBesNRUZGamkpCSP4Wa7HAAC\njzi3hi9na//XV5J+KWmJpKysLL366qsBjZrT6dTRo0ebbZO7433gwIGA/ayG3Nvlnt7rTk5OZrsc\nAFqBOLfWBd6VymmzqVbSfU6nljR4PBiBbklNTc257fKm8d6zZ49Onz4dlJ/r3i73FO+ePXuyXQ4A\nHhBnf2zf7jore+1a160hG5657b6fc1aWDk+dqh/df78+//zzRt9+7bXX6pVXXjF8W7iurk4HDhxo\nFu623C5vGu+kpCTD/3cBAKMQ50CoqHAd7bljh1RZKTkcUr9+0sSJ587QPnTokDIzM00b6JZ42i53\n/wnmdnlCQkKzz3J/97vf1Xe+852g/EwAMAvi3IZCOdDe1NbWetwud19dHujt8hEjRuiNN94I6GsC\ngNkQ5zZ26NAhZWRk6N///nejx0M50N64t8s9fZ67qKhIx461dFaaZ3379tXIkSMbbYEnJiaqY8eO\nQfgbAIAxiLMBvAX6uuuu08svvxxWgW6Je7vcU7xLS0s9fs/kyZN12WWXNTu4pVevXl6vGP/GN77R\nxn8zAPAPcTYIgW6Ze7u8abgfeugh/fCHP2z0tadPn9a+ffs8fva7uLhYnTt39nrFeI8ePWSz2Qz6\nWwKAZ8TZQAQ6+JxOpw4dOuT14JavvvrqXLSbxjsxMZHbdwIwBHE2GIE21vHjx5utzhse3NKzZ89m\nV4y7/1x00UVGjw8gTBFnE/AW6BEjRigvL49AG+TMmTONtsubxttut7d4+062ywG0FnE2ibKyMmVm\nZhLoEOF0OvXll196vAq9uLhYJ0+e9Hgeufv2nWyXA2gJcTYRAh0+Tpw44fUjZAcOHFB8fLzX23dG\nR0cbPT4AgxFnkyHQ4e/MmTMqKSnxuuqOjIz0evvOHj16cB45YAHE2YRaCvTLL7/MlmgYczqdKi8v\n93pc6okTJ7zevjMxMZFf3oAwQZxNqqysTBkZGfrPf/7T6HECbW0nTpzwelxqaWmpevTo4XXVzXY5\nEDqIs4kRaPjCvV3u7b3uTp06eQ13fHw82+WAiRBnkyPQCISG2+We4n38+HElJSV5PEWtT58+bJcD\nbYw4hwACjWA7efKkiouLPYZ7//7957bLPcU7JibG6PGBsEOcQ4S3QF9//fXKy8sj0Aias2fPnru6\n3FO8IyIivJ6i1rNnT7bLgVYgziGEQMNsnE6nKioqvJ5dfuzYsUZXlzeMd1JSEtvlgBfEOcSUlZVp\nyJAh2rVrV6PHCTTM6KuvvvJ6dvn+/fvVvXt3r0egOhwOo8cHDEOcQ5C3QN91111auHChQVMBvjl7\n9qz279/vddXdoUMHr6eo9erVi+1yhDXiHKKaBjo6OlqfffaZEhISDJ4M8J/T6dThw4e93nSksrJS\nffr08RjvPn36KDIy0ui/AuAX4hzC3IGuq6tTTEyM+vfvr6effpoVBcJedXW1x4vTiouLVVJSom7d\nunn9TDfb5QgFxDnElZWVyel0qkuXLho2bJi+973vEWhYWl1dXbPt8oZ/2rdv7zXcbJfDLIhzGDl+\n/Pi5QD/zzDPcTxhowul06siRI17DXVlZqcTERI/hTkpKYrscbYY4hxkCDbRedXW117PLS0pK1LVr\nV6+r7tjYWKPHRxghzmGIQAOBV1dXp9LSUq+r7nbt2nk9Ra1Xr15q37690X8FhBDiHKaqqqr0k5/8\nhEADbcC9Xe7tpiNHjx49t13eNN5JSUmKiooy+q8AkyHOYYxAA+bg3i73FO99+/Y12i5vGu/Y2Fj+\n7VoQcQ5z7kB///vf19NPP80/csBkGm6Xe4q3JI8nqCUnJyshIYHt8jBFnC2AQAOhyel06ujRo17D\nffjw4WZXl7vj3bdvX7bLQxhxtoiqqioNGzZMV155JYEGwkRNTU2jq8sbBnzv3r2Ki4vzegRqXFxc\n+Pz/QHm5lJsrFRZKVVVSdLSUkiJNmiR162b0dK1CnC2EQAPWUVdXpwMHDng9u7y+vt7rx8JCZru8\noECaO1fKz3f9d23t189FRUlOpzR8uJSTI6WlGTNjKxFniyHQACSd2y73FO+KigpdcsklXlfdptgu\nX7xYmjFDqqlxRdgbm80V6vnzpWnT2m4+PxFnC3IHOjU1VYsWLSLQABqpra1tdhiLO9x79+6Vw+Hw\nuupuk+1yd5irqy/8e+z2kAo0cbYoAg2gNerr65ttlzeMd11dnceDWJKTk9W7d2//t8sLCqQhQ3wL\ns5vdLm3aJKWm+jdDGyDOFlZVVaVrrrlGaWlpBBpAQFRWVno9Ra2iokK9e/f2ul1ut9vP/wOys6XX\nXmt5K9sbm00aNUp65RXfv7eNEWeLI9AA2kptba327t3rMdwNt8s9rby7du0qW0WFlJjY+MIvX0VG\nSiUlpr+KmzjjXKD79++vhQsXEmgAba6+vl4HDx70uuo+e/asHu3SRdO+/FKd6utb/4OioqTZs6UH\nHgjc8EFAnCGJQAMwt8rKStVPmKA498em/HHrrdLSpf6/ThBxV3FIkqKjo/X2229r27Ztuvvuu8Xv\nbADMxOFwKC5Qn72urAzM6wQRccY5MTExBBqAeUVHB+Z1HI7AvE4QEWc00jDQ99xzD4EGYB4pKa4L\nuvwRFSX16xeYeYKI95zh0bFjx3TNNddowIABeuqpp3gPGoDxysstc7U2K2d4FBMTo3feeUdbt25l\nBQ3AHLp3d52V3drFgs0mZWWZPswSK2ecBytoAKZikRPCWDmjRQ1X0Pfeey8raADGSktznZF9IaeJ\nNeQ+WzsEwiyxcsYFcq+g09PT9eSTT7KCBmAs7koFuBBoAKayfbvrfs5r17oiXFPz9XPu+zlnZbnu\n5xwiK2Y34gyfHDt2TFdffbUGDhxIoAGYQ0WFlJsr7djhOmDE4XB9XGrixJC4+MsT4gyfuQM9aNAg\nLViwgEADQIBxQRh8FhMTo3Xr1mnLli267777uEgMAAKMOKNVCDQABA9xRqu5P2ZFoAEgsIgz/OJw\nOAg0AAQYcYbfGgb6/vvvJ9AA4CfijIBwB/r9998n0ADgJ+KMgHE4HFq3bh2BBgA/EWcEFIEGAP8R\nZwRcw0D/8pe/JNAA4CPijKBwB3rz5s0EGgB8RJwRNAQaAFqHOCOo3IHetGkTgQaAC0ScEXQOh0Pr\n16/Xpk2bNGPGDAINAOdBnNEm3IHeuHEjgQaA8yDOaDMEGgAuDHFGm3K/B02gAcA74ow2Fxsbey7Q\nDzzwAIEGgCaIMwzhDvR7771HoAGgCeIMw7gDvWHDBgINAA0QZxgqNjZW69evJ9AA0ABxhuEaBvrB\nBx8k0AAsjzjDFNyBfvfddwk0AMsjzjANAg0ALsQZpkKgAYA4w4QaBvqhhx4i0AAshzjDlNyBXr9+\nPYEGYDnEGaZFoAFYVQejBwBa4g700KFDJUlPPPGEbDabwVMBQHARZ5ieO9BXXXWVJAINIPyxrY2Q\nEBcXp/Xr12vdunV6+OGH2eIGENZYOSNkuAPtXkHPmzePFTSAsEScEVIINAArIM4IOe5Auy8SI9AA\nwg1xRkiKi4vTu+++q6FDh8pms2nu3LkEGkDYIM4IWQ0DLYlAAwgbxBkhjUADCEfEGSGPQAMIN8QZ\nYaHhVdw2m02PP/44gQYQsogzwkbXrl0bfcyKQAMIVcQZYYVAAwgHxBlhxx1o93vQBBpAqCHOCEtd\nu3Zt9Dno3/3udwQaQMggzghbDQMtiUADCBnEGWGNQAMIRcQZYY9AAwg1xBmW4A50ZmambDab5syZ\nQ6ABmBZxhmV07dpVGzZsUGZmpiQRaACmRZxhKQQaQCggzrAcAg3A7IgzLKlhoG02mx577DECDcA0\niDMsq+lV3AQagFkQZ1hat27dCDQA0yHOsDwCDcBsiDOgCwh0ebmUmysVFkpVVVJ0tJSSIk2aJHXr\nZszQAMKWzel0Oo0eAjCLiooKZWZmauTIkXr00Udl275dmjtXys93fUFt7ddfHBUlOZ3S8OFSTo6U\nlmbM0ADCDnEGmnAH+ne9e2vEpk2y1dS4IuyNzeYK9fz50rRpbTcogLBFnAEPTvzf/6nDQw8pypd/\nHnY7gQYQEMQZaKqgQBoyRKqu9v177XZp0yYpNTXgYwGwjnZGDwCYzty5Uk1N6763psb1/QDgB1bO\nQEPl5VJiYuMLv3wVGSmVlHAVN4BWY+UMNJSb6/9r2GyBeR0AlkWcgYYKC/1bNUuure0dOwIzDwBL\nIs5AQ1VVgXmdysrAvA4ASyLOQEPR0YF5HYcjMK8DwJKIM9BQSorrgi5/REVJ/foFZh4AlsTV2kBD\nXK0NwARYOQMNde/uOiu7lXelctpsUlYWYQbgF+IMNJWT49qaboUap1N/z8wM8EAArIY4A02lpbnO\nyLbbffs+u137771XI+fM0bx588Q7RgBai/ecAW8WL5ZmzHB9btmHu1KVlpZq9OjR6tWrl3Jzc3XR\nRRe13cwAwgIrZ8CbadNcN7EYNcp1kVfTre6oKNfjo0a5vu6/d6NKSEjQ5s2b1b17d/Xv31+ff/65\nAcMDCGWsnIELUVHhOpJzxw7XASMOh+vjUhMntnjx1wsvvKAHH3xQixcv1o033thm4wIIbcQZCLJ/\n/OMfuvHGGzVmzBg9/vjj6tChg9EjATA54gy0gSNHjujmm2/W2bNn9dJLL6l79+5GjwTAxHjPGWgD\ncXFxys/PV3p6ulJTU7Vt2zajRwJgYqycgTb2+uuva+rUqZozZ46mTp0qWysPPAEQvogzYIBdu3Zp\n1KhRGjBggJ555hlF+nueN4CwwrY2YIBvfetb+vvf/66TJ09q8ODB2rdvn9EjATAR4gwYpEuXLnrp\npZc0fvx4/eAHP9C6deuMHgmASbCtDZjAxo0bNX78eN111116+OGHeR8asDjiDJhEaWmpxowZox49\neujFF1/k2E/AwtjWBkwiISFBGzduVHx8vNLS0vSvf/3L6JEAGIQ4AybSqVMnPfvss5o5c6Z+/OMf\nKy8vz+iRABiAbW3ApD755BNlZ2dr9OjRmjdvHsd+AhZCnAETO3LkiCZMmKBTp05p1apVHPsJWATb\n2oCJxcXFac2aNRo8eLBSU1O1detWo0cC0AZYOQMh4o033tDPfvYzPfroo7r99tv5uBUQxogzEEK+\n+OILZWdnKzU1Vc8++6yioqKMHglAELCtDYSQb37zm9q6datqa2s1ePBg7d271+iRAAQBcQZCTOfO\nnbVy5UrdeuutGjBggN555x2jRwIQYGxrAyFs8+bNuummm/SLX/xCOTk5ateO37eBcECcgRB34MAB\njRkzRt27d9eLL76o6Ohoo0cC4Cd+zQZCXK9evbRx40YlJCQoLS1Nn332mdEjAfATcQbCQEREhJ5+\n+mk98sgjysjI0KpVq4weCYAf2NYGwsynn36q7OxsjRw5Uk888YQ6duxo9EgAfEScgTB09OhRTZgw\nQTU1NVq1apUuvvhio0cC4AO2tYEwFBsbqzfffFM/+tGPOPYTCEGsnIEwt3r1ak2ZMkWzZ8/WHXfc\nwbGfQAggzoAF7N69W6NGjdKVV16pxYsXc+wnYHJsawMWcOmll2rr1q06ffq0Bg0apD179hg9EoAW\nEGfAIjp37qwVK1botttu04ABA/T2228bPRIAL9jWBizo/fff10033aRp06Zp5syZHPsJmAxxBizq\n4MGDGjNmjOLi4rR06VLFxMQYPRKA/+LXZcCievbsqffee0+JiYkc+wmYDHEGLCwiIkKLFi3SrFmz\nlJGRoZdeesnokQCIbW0A//XPf/5T2dnZuv766/X73/+eYz8BA7FyBiBJuuKKK7R9+3bt2rVLV111\nlQ4dOmT0SIBlEWcA5zgcDq1evVoZGRlKTU3Vhx9+aPRIgCWxrQ3AozVr1mjy5Mn6zW9+o+nTp3Ps\nJ9CGiDMAr4qKipSdna0rrrhCf/rTn2S3240eCbAEtrUBeJWcnKyPPvpI9fX1GjhwoIqLi40eCbAE\n4gygRXa7XcuWLdOUKVOUnp6u/Px8o0cCwh7b2gAu2AcffKBx48bp9ttv1yOPPMKxn0CQEGcAPikr\nK9PYsWMVExOjZcuWcewnEAT82gvAJ/Hx8dqwYYP69u2r1NRUFRYWGj0SEHaIMwCfdezYUU899ZRm\nz56toUOHauXKlUaPBIQVtrUB+KWwsFDZ2dm69tprNX/+fI79BAKAlTMAv6SkpKigoEBFRUXKzMxU\nWVmZ0SMBIY84A/Cbw+HQG2+8oauvvlppaWnasmWL0SMBIY1tbQABtXbtWk2aNEmPPPKI7rzzTo79\nBFqBOAMIuKKiIo0ePVr9+vXTkiVLOPYT8BHb2gACLjk5+dwdrdLT01VUVGTwREBoIc4AgsJut2vp\n0qWaOnWqBg4cqLVr1xo9EhAy2NYGEHRbtmzRuHHjNHXqVP3617/m2E/gPIgzgDZx6NAhjR07Vhdd\ndJGWLVsmh8Nh9EiAafHrK4A20aNHD7377ru69NJLlZaWxrGfQAuIM4A207FjRz355JN67LHHNHTo\nUK1YscLokQBTYlsbgCF27Nih7OxsDR8+XPPnz1dERITRIwGmwcoZgCH69eungoIC7dmzh2M/gSaI\nMwDDxMTE6PXXX9ewYcOUmpqqDz74wOiRAFNgWxuAKeTn52vixIn61a9+pbvuuotjP2FpxBmAaRQX\nF2v06NG6/PLL9dxzz6lz585GjwQYgm1tAKbRt29fbdmyRR06dFB6erp2795t9EiAIYgzAFOx2+3K\nzc3VHXfcoYEDB+rNN980eiSgzbGtDcC0PvzwQ40dO1ZTpkzRrFmzOPYTlkGcAZia+9jPLl26aPny\n5YqNjTV6JCDo+DUUgKm5j/287LLLlJaWpk8//dTokYCgI84ATK9jx45asGCB5syZo6uvvlrLli0z\neiQgqNjWBhBS3Md+Dhs2TH/84x859hNhiZUzgJDiPvazpKREGRkZOnjwoNEjAQFHnAGEnJiYGL32\n2msaPny40tLStHnzZqNHAgKKbW0AIe2tt97SbbfdppycHN1zzz0c+4mwQJwBhLw9e/YoOztb3/72\nt/X8889z7CdCHtvaAEJeUlKSPvzwQ0VERGjAgAH64osvjB4J8AtxBhAWoqKi9MILL2j69OkaNGiQ\nVq9ebfRIQKuxrQ0g7Hz00UcaO3asJk6cqN/+9rdq37690SMBPiHOAMLSl19+qXHjxikqKkorVqzg\n2E+EFLa1AYSliy++WOvWrdPll1+u1NRUffLJJ+eeY00Cs2PlDCDsrVq1Snfeeaf+8Ic/KDIyUsuX\nL9fSpUsVExNj9GiAR8QZgCXs3LlTWVlZOnjwoM6ePatLL71Ur776qvr162f0aEAzbGsDsISEhARF\nRETo7NmzkqTdu3drwIAB+stf/mLwZEBzxBmAJVRXVze7KKy6ulrjx4/XvffeqzNnzhg0GdAccQZg\nCfHx8dq8ebN+/vOfN3vuqaeeUmZmpsrKygyYDGiO95wBWM6f//xnTZ8+XadOnWr0eHx8vPLy8jRo\n0CCDJgNcWDkDsJzJkyfrgw8+0CWXXNLo8bKyMg0ZMkSLFi3i41YwFCtnAJZ1+PBh3XzzzVq/fn2z\n52655RYtWbJEdrvdgMlgdaycAVhW165d9dZbbyknJ6fZc8uXL1d6erqKiooMmAxWx8oZACT97W9/\n02233aYTJ040ejwmJkYrVqxQVlaWQZPBilg5A4CkUaNGqaCgQJdffnmjx48dO6brrrtOs2fPVn19\nvUHTwWpYOQNAAydPntTkyZOVl5fX7Llrr71Wy5Ytk8PhMGAyWAkrZwBooEuXLlq1apXmz5/f7FaT\na9asUWpqqgoLCw2aDlbByhkAvHjvvfc0btw4VVRUNHo8KipKzz//vCZMmGDQZAh3rJwBwIuMjAx9\n/PHH6t+/f6PHa2pqdMstt+juu+/W6dOnDZoO4YyVMwCcx6lTp3TPPfdoyZIlzZ4bNGiQ8vLyFB8f\nb8BkCFfEGQAu0AsvvKBp06Y1O/azR48eysvL0+DBgw2aDOGGbW0AuECTJk3Sli1blJiY2OjxQ4cO\nKSMjQwsXLuTYTwQEK2cA8NGRI0d08803a926dc2eGz9+vJ577jl17tzZgMkQLlg5A4CP4uLilJ+f\nr5kzZzZ7buXKlUpPT9fu3bsNmAzhgpUzAPjh9ddf109/+lMdP3680ePR0dFavny5rrvuOoMmQyhj\n5QwAfrjhhhs8HvtZVVWlESNGaNasWRz7CZ+xcgaAADh58qSmTJmiv/71r82eGz58uJYvX67Y2Niv\nHywvl3JzpcJCqapKio6WUlKkSZOkbt3abnCYEnEGgABxOp1asGCBHnzwQdXV1TV6LikpSa+++qr+\n98wZae5cKT/f9URt7ddfFBUlOZ3S8OFSTo6UltaG08NMiDMABNjGjRs1btw4lZeXN3r8zg4dtKBd\nO3U4c8YVYW9sNleo58+Xpk0L8rQwI+IMAEFQWlqqMWPGaOvWrZKk2yX9QZJPH7Cy2wm0RRFnAAiS\nU6dO6b777lPB4sXaKB/D7Ga3S5s2SampgR0OpkacASDI9l15pRI+/ljtz/+lzdls0qhR0iuvBHos\nmBhxBoBgKi+XEhMbX/jlq8hIqaSEq7gthM85A0Aw5eb6/xo2W2BeByGDOANAMBUW+rdqlqSaGmnH\njsDMg5BAnAEgmKqqAvM6lZWBeR2EBOIMAMEUHR2Y13E4AvM6CAnEGQCCKSXFdUGXP6KipH79AjMP\nQgJXawNAMHG1NlqBlTMABFP37q6zsm221n2/zSZlZRFmi2HlDADBVlAgDRkiVVf7/r2cEGZJrJwB\nINjS0lxnZNvtvn2f+2xtwmw5HYweAAAswX3zihkzXJ9b5q5UaAHb2gDQlrZvd93Pee1aV4Rrar5+\nzn0/56ws1/2cWTFbFnEGACNUVLiO5Nyxw3XAiMPh+rjUxIlc/AXiDACA2XBBGAAAJkOcAQAwGeIM\nAIDJEGcAAEyGOAMAYDLEGQAAkyHOAACYDHEGAMBkiDMAACZDnAEAMBniDACAyRBnAABMhjgDAGAy\nxBkAAJMhzgAAmAxxBgDAZIgzAAAmQ5wBADAZ4gwAgMkQZwAATIY4AwBgMsQZAACTIc4AAJgMcQYA\nwGSIMwAAJkOcAQAwGeIMAIDJEGcAAEyGOAMAYDLEGQAAkyHOAACYDHEGAMBkiDMAACZDnAEAMBni\nDACAyRBnAABMhjgDAGAyxBkAAJP5fzWIX0z6zC2WAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<Figure size 432x288 with 1 Axes>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "# NetworkX Graphs - Cypher query results can be coerced to NetworkX MultiDiGraphs, graphs that permit multiple edges between nodes, with the get_graph method. You'll first need to install NetworkX with pip install networkx.\n",
    "\n",
    "results = %cypher http://neo4j:root@localhost:7474/db/data MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "NodeDataView({'0': {'name': 'Mountain Dew', 'calories': 9000, 'labels': ['Drink']}, '5': {'name': 'Drew', 'age': 20, 'labels': ['Person']}, '3': {'name': 'Nicole', 'age': 24, 'labels': ['Person']}, '4': {'name': 'Coke Zero', 'calories': 0, 'labels': ['Drink']}})"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "DiMultiDegreeView({'0': 2, '5': 1, '3': 2, '4': 1})"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# igraph - Cypher query results can be imported into igraph with py2neo. You'll need to install igraph with pip install python-igraph. Query results should be returned as edgelists, as igraph has a method for building an igraph object from a list of tuples representing edges between nodes.\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-160c2c34-917e-4ea2-838a-78b453f38cf6\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-160c2c34-917e-4ea2-838a-78b453f38cf6');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 4 },\n",
       "        { \"source\": 2, \"target\": 0 },\n",
       "        { \"source\": 3, \"target\": 0 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 5, \"target\": 0 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"0\": { \"location\": [ -2.0, -2.0, -2.0 ] },\n",
       "        \"1\": { \"location\": [ -1.7160115162128924, -1.7644730577351915, -1.7169761768302412 ] },\n",
       "        \"2\": { \"location\": [ -0.5455045898754903, -0.6502670000410348, -0.20810477724654775 ] },\n",
       "        \"3\": { \"location\": [ 0.7681712925411134, 0.017039895084809964, 0.2546770070794952 ] },\n",
       "        \"4\": { \"location\": [ 1.823683432435758, 2.0, 1.3792315093780811 ] },\n",
       "        \"5\": { \"location\": [ 2.0, 2.0, 2.0 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# References: \n",
    "# http://nicolewhite.github.io/\n",
    "\n",
    "# Explore\n",
    "# https://medium.com/elements/diving-into-graphql-and-neo4j-with-python-244ec39ddd94"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
